[
    {
        "title": "Biden talks of 'unfair economic practices' in call with Xi",
        "date": "12 Feb 2021",
        "text": "JOE Biden, in his first conversation as US president with Chinese leader Xi Jinping, spoke of his concern about China's \"coercive and unfair economic practices\" as well as human rights abuses in the Xinjiang region, according to a White House account of their telephone call."
    },
    {
        "title": "Biden announces sanctions targeting Myanmar military leaders",
        "date": "11 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden said his administration will sanction military leaders in Myanmar linked to this month's coup and will ensure the country's military leadership can't access about US$1 billion in government funds held in the US."
    },
    {
        "title": "Taiwan expresses 'admiration' for Biden's 'rock solid' support",
        "date": "11 Feb 2021",
        "text": "[TAIPEI] Taiwan's government expressed its thanks to and \"admiration\" for US President Joe Biden on Thursday after he told his Chinese counterpart Xi Jinping of his concerns about Beijing's pressure against the island which China claims as its own territory."
    },
    {
        "title": "Biden speaks by phone with China's Xi Jinping",
        "date": "11 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden expressed concerns to Chinese leader Xi Jinping about human rights in Hong Kong and Xinjiang late Wednesday in their first call since Mr Biden took office on Jan 20, according to the White House."
    },
    {
        "title": "Macron floats brokered Airbus-Boeing accord to Biden: report",
        "date": "11 Feb 2021",
        "text": "[NEW YORK] French President Emmanuel Macron told US President Joe Biden that the leaders could broker a settlement to the long-running trade dispute between Boeing and Airbus, according to a media report on Wednesday."
    },
    {
        "title": "    Biden team asks court to pause move to ban TikTok in US",
        "date": "11 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden's administration has asked a US federal court to pause proceedings aimed at banning TikTok to allow for a fresh review of the national security threat from the popular Chinese-owned video app."
    },
    {
        "title": "    Biden announces new Pentagon task force on China",
        "date": "11 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden announced Wednesday the formation of a special Defence Department task force on China and ordered an immediate review of the military's strategic approach to the challenge from Beijing."
    },
    {
        "title": "TikTok sale to Walmart, Oracle shelved amid Biden review: WSJ",
        "date": "10 Feb 2021",
        "text": "[NEW YORK] TikTok's forced sale to Walmart and Oracle. has been shelved indefinitely as the Biden administration takes on a broad review of national security risks posed by Chinese technology companies initiated under his predecessor, according to the Wall Street Journal."
    },
    {
        "title": "    Biden presses for 'big' stimulus in meeting with CEOs",
        "date": "10 Feb 2021",
        "text": "[NEW YORK] President Joe Biden met Tuesday with a handful of top CEOs, hammering home the need to \"move big\" on his US$1.9 trillion stimulus bill while receiving input on a proposal to raise the minimum wage."
    },
    {
        "title": "Huawei CEO hopes for 'open policy' from Biden administration",
        "date": "09 Feb 2021",
        "text": "[TAIYUAN, China] The CEO and founder of Chinese telecom giant Huawei called Tuesday for an open approach from new US President Joe Biden, after the firm was battered by sanctions imposed by Donald Trump's administration."
    },
    {
        "title": "    Inflation hawks critique Biden's US$1.9t spending plan",
        "date": "09 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden's US$1.9 trillion proposal aimed at revitalising the US economy has drawn skepticism from some economists, including a former Treasury secretary who is also a member of his Democratic Party."
    },
    {
        "title": "    Biden, Modi speak of climate, 'democratic' values in first talks",
        "date": "09 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden signaled he would seek to deepen the close US relationship with India in his first talks with Prime Minister Narendra Modi as he added climate change and \"democratic\" values to the agenda."
    },
    {
        "title": "All eyes on Biden as he negotiates the Asian triangle",
        "date": "09 Feb 2021",
        "text": "HOW Joe Biden handles China will be one of the defining issues of his presidency. He inherits a Sino-American relationship that is at its lowest point in 50 years. Some people blame this on his predecessor, Donald Trump. But Mr Trump merits blame for pouring petrol on a fire. It was China's leaders who lit and kindled the flames."
    },
    {
        "title": "Biden says challenging for US to reach herd immunity by summer's end",
        "date": "08 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden said that it will be difficult for the United States to reach herd immunity, at least 75 per cent of the population inoculated against the coronavirus, by the end of this summer."
    },
    {
        "title": "Biden foresees 'extreme competition' with China, not 'conflict'",
        "date": "08 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden anticipates the US rivalry with China will take the form of \"extreme competition\" rather than conflict between the two world powers."
    },
    {
        "title": "Biden's Cabinet sets the bar on diversity, experience",
        "date": "08 Feb 2021",
        "text": "THE White House is working hard to rebrand itself as an institution of competence, rather than one of chaos and personality cults."
    },
    {
        "title": "Biden urges fast Covid-19 relief as minimum-wage hike hopes fade",
        "date": "06 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden gave his strongest indication yet that he'll push for swift action on coronavirus relief for the US economy without Republican support, as House lawmakers cleared the way for passing his US$1.9 trillion stimulus plan with only Democratic votes."
    },
    {
        "title": "    US: Stocks rise as weak jobs data seen boosting Biden plan",
        "date": "06 Feb 2021",
        "text": "[NEW YORK] Wall Street stocks added to records early Friday on expectations that a lackluster US jobs report bolstered the odds of passage of President Joe Biden's economic relief package."
    },
    {
        "title": "US Senate passes budget plan to advance Biden's US$1.9t Covid aid package",
        "date": "05 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden's drive to enact a US$1.9 trillion coronavirus aid Bill gained momentum early on Friday as the US Senate narrowly approved a budget blueprint allowing Democrats to push the legislation through Congress in coming weeks with or without Republican support."
    },
    {
        "title": "Biden says no more US 'rolling over' to Russia",
        "date": "05 Feb 2021",
        "text": "[WASHINGTON] President Joe Biden said on Thursday the United States will no longer be \"rolling over in the face of Russia's aggressive actions\" and demanded release of jailed opposition leader Alexei Navalny."
    },
    {
        "title": "    Biden administration indicates in no hurry to engage China",
        "date": "03 Feb 2021",
        "text": "[WASHINGTON] The Biden administration indicated on Tuesday it is in no hurry to engage with China, a strategic rival it has vowed to out-compete, and said it and would do so once it was in \"lockstep\" with allies and partners."
    },
    {
        "title": "    Biden to streamline US immigration, chip away at Trump legacy",
        "date": "03 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden will sign three more executive orders on immigration on Tuesday as part of a drive to erase the hardline legacy of Donald Trump, including an effort to reunite children separated from their parents at the US border with Mexico."
    },
    {
        "title": "    Biden to keep tariffs on aluminum imports from UAE, reversing Trump",
        "date": "02 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden will maintain a tariff of 10 per cent on aluminum imports from the United Arab Emirates, reversing Donald Trump's move to end the levies on his last day as president, the White House said on Monday."
    },
    {
        "title": "Biden demands Myanmar military cede power, orders sanctions review",
        "date": "02 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden called on Monday on Myanmar's military to relinquish power immediately and ordered a review to consider reimposing sanctions lifted during the nation's transition to democracy."
    },
    {
        "title": "Biden eyes climate market legacy with Brussels, Beijing",
        "date": "02 Feb 2021",
        "text": "WHILE US President Joe Biden's first 100 days will be driven by the Covid-19 crisis, his long-term presidential legacy is much more likely to be shaped by climate change."
    },
    {
        "title": "    Republicans press Biden to downsize US$1.9t Covid-19 relief plan",
        "date": "01 Feb 2021",
        "text": "[WASHINGTON] Ten moderate Republican US senators urged President Joe Biden on Sunday to significantly downsize his sweeping US$1.9 trillion Covid-19 relief package to win bipartisan support as Democrats in Congress prepared to push ahead with his plan this week."
    },
    {
        "title": "US oil pushes 'clean shale' as Biden rolls out climate policies",
        "date": "01 Feb 2021",
        "text": "AMERICAN oil executives began a pushback against some of President Joe Biden's climate policies by making the case that fossil fuels from US shale have a lower carbon footprint than imports."
    },
    {
        "title": "In Biden's White House, masks, closed doors and empty halls",
        "date": "30 Jan 2021",
        "text": "[WASHINGTON] Senior staff members limit interactions with each other in most offices to a total of 15 minutes in a day. No more than six people are allowed to gather in the Oval Office at a time, and a maximum of five staff members are allowed to meet together in the spacious office of the chief of staff, Ron Klain."
    },
    {
        "title": "Biden talks the talk in first 10 days - but can he deliver?",
        "date": "29 Jan 2021",
        "text": "[WASHINGTON] Normal is the new extraordinary under President Joe Biden."
    },
    {
        "title": "    New US jobless benefit claims fall as Biden takes office",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] New applications for US unemployment benefits fell more than expected last week as President Joe Biden took office, but remain distressingly high months after the Covid-19 pandemic began, according to government data released Thursday."
    },
    {
        "title": "    In multiple messsages, Biden warns Beijing over expansionism",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] One week into the job, US President Joe Biden has sent a clear warning to Beijing against any expansionist intentions in East and Southeast Asia."
    },
    {
        "title": "Biden polls higher in first week than Trump at any time",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] US President Joe Biden has a higher approval rating after one week in office than Donald Trump did in his entire presidency, a new poll found on Wednesday."
    },
    {
        "title": "US must lead world on climate crisis, says Biden",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden said Wednesday the United States must lead the global response to the climate crisis, as he signed a raft of orders aimed at curbing rising temperatures and announced a climate summit in April."
    },
    {
        "title": "Biden resets by stressing US commitment to defend Japan",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden reaffirmed on Wednesday the United States' commitment to defend Japan in his first phone call with Prime Minister Yoshihide Suga, striking a note of reassurance after the Trump era."
    },
    {
        "title": "Yellen faces huge obstacles in executing Biden's big economic plan",
        "date": "28 Jan 2021",
        "text": "THE 74-year-old economist Dr Janet Yellen has made history this week by becoming the first woman to lead the US Treasury Department, after a bipartisan majority in the Senate confirmed her nomination by an 84-15 vote on Monday."
    },
    {
        "title": "Biden faces balancing act in dealing with China",
        "date": "27 Jan 2021",
        "text": "AS CHAIRMAN of the powerful Senate Foreign Relations Committee and later, as an influential vice-president in the administration of President Barack Obama, Joe Biden, one of Washington's leading foreign policy voices, tended to echo the bipartisan consensus that dominated US policy toward China since the opening to the communist regime following President Richard Nixon's historic 1972 visit to Beijing."
    },
    {
        "title": "What Biden's Asia pivot signals",
        "date": "27 Jan 2021",
        "text": "FEW things say more about an administration's approach to policy than the composition of its team. And in seeking to appoint \"Mr Pivot\" - Kurt Campbell - to coordinate his approach to the Indo-Pacific, US President Joe Biden is signalling the intent of his administration to deliver a China strategy that is coherent, constructive and, above all, realistic."
    },
    {
        "title": "    Biden stimulus plan could boost US output by 5 per cent over three years: IMF",
        "date": "26 Jan 2021",
        "text": "[WASHINGTON] Preliminary estimates show US President Joe Biden's proposed US$1.9 trillion economic stimulus package could boost US economic output by 5 per cent over the next three years, the chief ecnomist of the International Monetary Fund said Monday."
    },
    {
        "title": "Union lauds Biden action on slaughter speeds industry calls safe",
        "date": "26 Jan 2021",
        "text": "[CHICAGO] A major food workers' union praised President Joe Biden for withdrawing a rule that would have permanently allowed US poultry producers to kill more chickens per minute. Industry trade groups said the speeds were safe."
    },
    {
        "title": "    Biden doesn't believe Trump will be convicted at his impeachment trial: CNN",
        "date": "26 Jan 2021",
        "text": "[WASHINGTON] US President Joe Biden said on Monday he does not believe there will be enough votes to convict former President Donald Trump at his impeachment trial, CNN reported."
    },
    {
        "title": "    US 'well on' way to Covid-19 herd immunity by summer: Biden",
        "date": "26 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden on Monday said the United States should be closing in on Covid herd immunity by summer, with mass vaccinations becoming available in the spring."
    },
    {
        "title": "Biden hits ground running, but will a new day dawn in America?",
        "date": "26 Jan 2021",
        "text": "IN his inaugural address last week US President Joe Biden appealed for a fresh start for a nation wounded by political divisions and recovering from a violent assault on the US Capitol: a renewed sense of unity and commitment for democratic principles, a return to truth and decency, and a growing respect for the rule of law."
    },
    {
        "title": "China's Xi to address Davos in first remarks during Biden era",
        "date": "25 Jan 2021",
        "text": "[BEIJING] Chinese President Xi Jinping is set to deliver his first speech since Joe Biden entered the White House, remarks that could set the tone for relations between the world's biggest economies over the next four years."
    },
    {
        "title": "Biden to reinstate Covid-19 travel bans: White House official",
        "date": "25 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden will announce he is re-imposing a Covid-19 travel ban on most non-US citizens who have been in Britain, Brazil, Ireland and much of Europe, a White House official said Sunday, as the new administration ramps up its pandemic response."
    },
    {
        "title": "Biden to impose South Africa travel ban to combat new Covid-19 variant: CDC",
        "date": "25 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden will impose a ban on most non-US citizens entering the country who have recently been in South Africa starting Saturday in a bid to contain the spread of a new variant of Covid-19, a senior US public health official told Reuters."
    },
    {
        "title": "Paris says Biden, Macron in agreement on Covid-19, climate change",
        "date": "25 Jan 2021",
        "text": "[PARIS] French President Emmanuel Macron and new US President Joe Biden are in agreement on climate change and how to fight coronavirus, the Elysee palace said on Sunday."
    },
    {
        "title": "China-Taiwan tensions rise days into Biden presidency",
        "date": "25 Jan 2021",
        "text": "CHINESE air force planes including 12 fighter jets entered Taiwan's air defence identification zone for a second day on Sunday, Taiwan said, as tensions rise near the island just days into US President Joe Biden's new administration."
    },
    {
        "title": "Oil industry reels as Biden targets fossil fuels in his first days",
        "date": "25 Jan 2021",
        "text": "HOURS after taking office, President Joe Biden made good on a campaign promise to cancel the Keystone XL oil pipeline. Later that day his Interior Department mandated that only top agency leaders could approve new drilling permits over the next two months."
    },
    {
        "title": "Canada says Trudeau, Biden to have first meeting 'next month'",
        "date": "23 Jan 2021",
        "text": "[OTTAWA] Canadian leader Justin Trudeau and new US President Joe Biden spoke on the phone on Friday on an extensive range of topics, and made plans to meet in person \"next month.\""
    },
    {
        "title": "    Biden White House atmosphere is transformed",
        "date": "23 Jan 2021",
        "text": "[WASHINGTON] Camped out in bare offices, President Joe Biden's new White House team has spent its first three days scrambling for things like binder clips and IT support - oh, and trying to save the country from multiple crises."
    },
    {
        "title": "Biden's presidency looks promising for gold, yet rising Treasury yields may limit gains",
        "date": "23 Jan 2021",
        "text": "GOLD rallied this week on the back of Janet Yellen's testimony to the US Senate and Joe Biden's inauguration as the 46th President of the United States. Dr Yellen in her confirmation hearing as the new Treasury Secretary forwarded the case for more fiscal stimulus to relieve the pandemic-battered US economy, indicating that she favoured much of President Biden's US$1.9 trillion package."
    },
    {
        "title": "    Biden inauguration draws bigger television audience than Trump's",
        "date": "22 Jan 2021",
        "text": "[NEW YORK] The TV audience for Joe Biden's inauguration surpassed the number who watched Donald Trump four years ago, a sign that news channels may keep viewers' interest during a new administration."
    },
    {
        "title": "    US Congress moves toward approving Biden's defence secretary pick",
        "date": "22 Jan 2021",
        "text": "[WASHINGTON] The US House of Representatives and Senate backed a waiver on Thursday that paved the way for President Joe Biden's nominee, Lloyd Austin, to lead the Pentagon even though he has not cleared the required seven-year waiting period since leaving the military."
    },
    {
        "title": "Biden administration pauses federal drilling programme in climate push",
        "date": "22 Jan 2021",
        "text": "[LOS ANGELES] President Joe Biden's administration has temporarily suspended oil and gas permitting on federal lands and waters in the latest of a series of rapid-fire orders aimed at fighting climate change and tamping down the US fossil fuel industry."
    },
    {
        "title": "Biden unveils coronavirus plan, but says 100,000 may die over next month",
        "date": "22 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden unveiled a national strategy to combat the coronavirus while issuing a sobering warning: The pandemic is likely to claim another 100,000 lives over roughly the next month and will worsen before it improves."
    },
    {
        "title": "    US: S&P, Nasdaq close at record highs on optimism about Biden stimulus plan",
        "date": "22 Jan 2021",
        "text": "[NEW YORK] The S&P 500 and Nasdaq closed at record highs on Thursday, propelled by optimism about more pandemic relief under the Biden administration to support the economy after data showed a tepid labour market recovery."
    },
    {
        "title": "Biden to order masks, traveller quarantines in Covid fight",
        "date": "22 Jan 2021",
        "text": "UNITED States President Joe Biden will push for additional travel safety during the coronavirus pandemic by requiring people to wear masks in airports and on planes while enforcing quarantines for people who arrive in the US from other countries."
    },
    {
        "title": "Biden signs 17 executive orders, memorandums and proclamations on his first day at work",
        "date": "22 Jan 2021",
        "text": "US President Joe Biden unleashed a full-scale assault on his predecessor's legacy on Wednesday, acting hours after taking the oath of office to sweep aside former president Donald Trump's pandemic response, reverse his environmental agenda, tear down his anti-immigration policies, bolster the sluggish economic recovery and restore federal efforts aimed at promoting diversity."
    },
    {
        "title": "Biden calls for unity to heal divided nation",
        "date": "22 Jan 2021",
        "text": "PRESIDENT Joe Biden took command of the United States on Wednesday, vowing to save the union from the threats of a pandemic and Trumpism."
    },
    {
        "title": "STI regains 3,000 level as equity markets cheer Biden's swearing-in",
        "date": "22 Jan 2021",
        "text": "GLOBAL equity markets cheered the swearing-in of US president Joe Biden, as key regional indexes ended trading on Thursday with gains. Singapore's benchmark Straits Times Index (STI) breached the 3,000 mark and closed at 3,017.15 points, up 18.38 points or 0.61 per cent."
    },
    {
        "title": "Biden's message of unity may not change the minds of ardent Trumpists",
        "date": "22 Jan 2021",
        "text": "AMERICAN presidents have used their inaugural address to present their vision of the nation and set their goals for it, delivering in many cases some of the most eloquent speeches in US history that are still quoted today."
    },
    {
        "title": "Jobless claim data underscores employment crisis awaiting Biden",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] Government data released the day after Joe Biden entered the White House made clear the scale of the employment crisis facing the new US president as the country struggles to make it through the Covid-19 pandemic."
    },
    {
        "title": "Biden's swearing-in lifts regional indexes; STI breaches 3, 000-mark",
        "date": "21 Jan 2021",
        "text": "GLOBAL equity markets cheered the swearing-in of US President Joe Biden, as many key regional indexes ended trading on Thursday with gains."
    },
    {
        "title": "Biden's Keystone 'insult' sees Alberta leader urging retaliation",
        "date": "21 Jan 2021",
        "text": "[OTTAWA] The leader of Canada's oil heartland called President Joe Biden's decision to cancel the Keystone XL pipeline project an \"insult\" and urged Prime Minister Justin Trudeau to consider retaliation."
    },
    {
        "title": "Europe: Stocks extend gains on Biden bounce",
        "date": "21 Jan 2021",
        "text": "[LONDON] European stock markets rose at the start of trading onThursday, extending a bounce on the back of Joe Biden taking office as US president."
    },
    {
        "title": "Tokyo: Nikkei closes at 30-year high as Biden inauguration sparks optimism",
        "date": "21 Jan 2021",
        "text": "[TOKYO] Japanese shares hit their highest close in 30 years, taking cues from solid overnight performances on Wall Street, on investor optimism over upbeat corporate earnings and that new US administration's massive stimulus package will bolster growth."
    },
    {
        "title": "Biden's inauguration a restoration of American democracy",
        "date": "21 Jan 2021",
        "text": "PRESIDENT Joe Biden took command of the US on Wednesday, vowing to save the union from the threats of a pandemic and Trumpism."
    },
    {
        "title": "President Halimah and PM Lee congratulate US President Biden on his inauguration",
        "date": "21 Jan 2021",
        "text": "[SINGAPORE] President Halimah Yacob and Prime Minister Lee Hsien Loong have sent congratulatory letters to United States President Joe Biden on his inauguration, wishing him success as he assumes office."
    },
    {
        "title": "Asia: Stocks see healthy gains with Biden presidency",
        "date": "21 Jan 2021",
        "text": "[HONG KONG] Asian markets welcomed Joe Biden's first day as US president with broad gains Thursday as investors look forward with optimism about his economic and Covid recovery plans."
    },
    {
        "title": "Singapore stocks open higher on Thursday as Biden takes office; STI up 0.2%",
        "date": "21 Jan 2021",
        "text": "SINGAPORE shares opened in positive territory on Thursday, following a strong lead from Wall Street overnight, as Joe Biden was inaugurated as the 46th president of the United States."
    },
    {
        "title": "Australia: Shares open higher as Biden inauguration boosts sentiment",
        "date": "21 Jan 2021",
        "text": "[BENGALURU] Australian shares advanced on Thursday, helped by gains among technology and gold stocks, as broader risk sentiment was lifted after the swearing in of Joe Biden as the 46th US President."
    },
    {
        "title": "Taiwan-Biden ties off to strong start with invite for top diplomat",
        "date": "21 Jan 2021",
        "text": "[TAIPEI] Taiwan's relationship with its most important global backer the United States has gotten off to a strong start with President Joe Biden's new administration, after the island's de facto ambassador attended his inauguration."
    },
    {
        "title": "    Biden to roll back Trump policies, remake US role in climate crisis",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden committed the United States to rejoining the Paris climate accord, blocked an oil pipeline project and froze Arctic drilling in a raft of executive orders signed hours after taking office Wednesday."
    },
    {
        "title": "    'Going home': Biden's surreal walk to the White House",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] Joe Biden held his wife Jill's hand as they strode up their new home's driveway on Wednesday - which was the only normal thing about the day he became the president of the United States."
    },
    {
        "title": "    Biden sworn in amid historic challenges: 'This is America's day'",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] Joseph Robinette Biden Jr. was sworn in as the 46th president of the United States, taking control of a nation wracked by a deadly pandemic, persistent unemployment and burgeoning social unrest to cap the most acrimonious transfer of power in modern American history."
    },
    {
        "title": "    Biden set to rejoin Paris climate accord, impose curbs on US oil industry",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] US President Joe Biden will announce America's return to the international Paris Agreement to fight climate change on Wednesday, the centerpiece of a raft of day-one executive orders aimed at restoring US leadership in combating global warming."
    },
    {
        "title": "Twitter shifts US presidential accounts to Biden team",
        "date": "21 Jan 2021",
        "text": "[SAN FRANCISCO] As US President Joe Biden took office on Wednesday, Twitter handed him the reins of an official @POTUS account as part of the transfer of power."
    },
    {
        "title": "    Oil rises on US stimulus hopes, tighter market under Biden",
        "date": "21 Jan 2021",
        "text": "[NEW YORK] Oil edged higher on Wednesday on expectations that US President Joe Biden's administration will deliver hefty pandemic-related economic stimulus that will lift fuel demand and enact policies that will tighten crude supply."
    },
    {
        "title": "US: Wall Street closes at record high after Biden takes office",
        "date": "21 Jan 2021",
        "text": "[NEW YORK] Wall Street greeted new US President Joe Biden by climbing even higher on Wednesday, closing at records amid promises of big economic stimulus and relief that the inauguration was uneventful."
    },
    {
        "title": "    Biden says Trump wrote him 'very generous letter'",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden said Wednesday that outgoing president Donald Trump had left him a \"very generous\" letter in the Oval Office, in keeping with tradition."
    },
    {
        "title": "Asian markets upbeat on stimulus hopes ahead of Biden's inauguration",
        "date": "21 Jan 2021",
        "text": "ASIAN markets mostly rose on Wednesday, just before the inauguration of Joe Biden as US President, as investors looked with optimism towards the stimulus that could follow, but analysts noted that US-China tensions may not go away."
    },
    {
        "title": "US-China dialogue under Biden may be more reasoned: top economist",
        "date": "21 Jan 2021",
        "text": "WHERE US-China relations are concerned, there is no going back to the era of goodwill that preceded former US president Donald Trump's administration, according to top economist Raghuram Rajan."
    },
    {
        "title": "On Day One, Biden moves swiftly to undo Trump's legacy",
        "date": "21 Jan 2021",
        "text": "PRESIDENT-ELECT Joe Biden will unleash a full-scale assault on his predecessor's legacy on Wednesday, acting hours after taking the oath of office to sweep aside President Donald Trump's pandemic response, reverse his environmental agenda, tear down his anti-immigration policies, bolster the sluggish economic recovery and restore federal efforts aimed at promoting diversity."
    },
    {
        "title": "Biden's huge economic relief plan aims to tackle poverty, inequality head-on",
        "date": "21 Jan 2021",
        "text": "PRESIDENT-ELECT Joe Biden has tabled his near-term US rescue plan and surprised many with a US$1.9 trillion economic relief proposal. He is looking to avoid the mistake made by former president Barack Obama's administration: too little fiscal support following the global financial crisis. Amounting to 9 per cent of gross domestic product, on top of the US$900 billion passed in December, Mr Biden is tackling poverty and inequality in the US head-on."
    },
    {
        "title": "    US: Stocks gain ahead of Biden inauguration",
        "date": "20 Jan 2021",
        "text": "[NEW YORK] The Nasdaq led US stocks higher early Wednesday ahead of the inauguration of President-elect Joe Biden amid hopes for more stimulus spending and an improved rollout of coronavirus vaccines."
    },
    {
        "title": "Trump leaves White House, skipping Biden inauguration",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump left the White House for the last time on Wednesday, skipping the inauguration of successor Joe Biden as the 46th US president in an extraordinary break with tradition."
    },
    {
        "title": "US, China must renegotiate relationship under Biden administration: ex-IMF chief economist",
        "date": "20 Jan 2021",
        "text": "CONCERNING the US-China relationship, there is no going back to the era of goodwill that preceded outgoing US President Donald Trump's administration, according to top economist Dr Raghuram Rajan."
    },
    {
        "title": "Asia: Markets mostly up on hope for Biden recovery agenda",
        "date": "20 Jan 2021",
        "text": "[HONG KONG] Asian investors pushed markets higher again on Wednesday as they await the swearing-in of Joe Biden, while they have taken heart from comments by Treasury nominee Janet Yellen as she looks to push through the new president's stimulus proposals."
    },
    {
        "title": "Biden to unveil sweeping immigration reforms",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden will roll back Donald Trump's tough approach to undocumented immigrants in sweeping reforms to be introduced on his first day in office, Mr Biden's Homeland Security Department nominee said on Tuesday."
    },
    {
        "title": "    Biden to keep Jerusalem embassy but seek Palestinian state, nominee says",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden will not reverse Donald Trump's landmark recognition of Jerusalem as Israel's capital but will seek a state for the Palestinians, Antony Blinken, his nominee for secretary of state, said Tuesday."
    },
    {
        "title": "Biden arrives at air base near Washington on eve of inauguration",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] Joe Biden arrived at Joint Base Andrews near Washington on Tuesday, returning to the capital on the eve of his inauguration as the 46th president of the United States."
    },
    {
        "title": "Biden pushes unity two days before taking over crisis-laden White House",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] On the cusp of becoming president, Joe Biden pressed on Monday for unity, while President Donald Trump remained secluded in the White House at the centre of a capital inundated with troops and security barriers."
    },
    {
        "title": "    In farewell address, Trump wishes luck to next administration without mentioning Biden",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump, in a farewell address released on Tuesday, touted his legacy and wished luck to the new administration of President-elect Joe Biden but without acknowledging his successor by name."
    },
    {
        "title": "    Oil gains on stimulus optimism ahead of Biden inauguration",
        "date": "20 Jan 2021",
        "text": "[NEW YORK] Oil prices climbed with US stock markets on Tuesday ahead of Joe Biden's inauguration as US president on optimism that more government stimulus will eventually lift global economic growth."
    },
    {
        "title": "UK's Johnson congratulates Biden ahead of inauguration",
        "date": "20 Jan 2021",
        "text": "[LONDON] British Prime Minister Boris Johnson said late on Tuesday he was looking forward to \"working closely\" with incoming US president Joe Biden, on the eve of his inauguration in Washington."
    },
    {
        "title": "The Biden bulldozer is ready to roll on",
        "date": "20 Jan 2021",
        "text": "AS US President-elect Joe Biden takes office in Washington, DC, on Wednesday, in the midst of a deadly pandemic and an economic crisis, against the backdrop of deep racial and cultural divisions, and following the shattering assault on the Capitol, he will be facing massive challenges unlike those that confronted his predecessors, starting with the need to unify the country. Only time will tell if he is up to the task."
    },
    {
        "title": "Biden's rejection of pipeline throws 'wrench' in Canada, US ties",
        "date": "19 Jan 2021",
        "text": "[OTTAWA] Prime Minister Justin Trudeau is eager to turn the page on four years of strained ties with Canada's neighbor, but US President-elect Joe Biden's plan to block a major oil pipeline complicates the reset, experts say."
    },
    {
        "title": "Biden team says US will not lift travel bans, despite Trump statement",
        "date": "19 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden's spokeswoman quickly dismissed Donald Trump's announcement on Monday that a Covid-19 ban on travelers arriving from much of Europe and Brazil would be lifted, underlining the fractious transition of power."
    },
    {
        "title": "Biden taps veteran regulators to lead key Wall Street watchdogs",
        "date": "19 Jan 2021",
        "text": "US President-elect Joe Biden has picked a pair of veteran regulators strongly backed by progressive Democrats to lead two key Wall Street watchdogs, signalling that his administration is planning tough oversight after four years of light-touch policies under appointees of President Donald Trump."
    },
    {
        "title": "    Meet the Bidens: America's new 'first family'",
        "date": "18 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden and his wife Jill will become the new White House residents when he takes office on Wednesday."
    },
    {
        "title": "    Biden to cancel Keystone XL pipeline permit on first day in office: CBC",
        "date": "18 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden is planning to cancel the Keystone XL pipeline permit via executive action on his first day in office, CBC News reported on Sunday, citing sources."
    },
    {
        "title": "    Biden team lays out plans as inauguration, impeachment loom",
        "date": "18 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden's top advisors on Sunday outlined his plans to tackle the nation's multiple crises while balancing the impeachment trial of Donald Trump, as an historic inauguration week opens in the United States."
    },
    {
        "title": "    Trump to leave town early Wednesday before Biden inauguration",
        "date": "16 Jan 2021",
        "text": "[WASHINGTON] By the time Joe Biden is sworn in as the 46th US president Wednesday, his scandal-tainted predecessor Donald Trump will already be far away, having helicoptered out of the White House a last time earlier that morning, an official said Friday."
    },
    {
        "title": "Retired doctors and more syringes: Biden lays out plan to get America vaccinated",
        "date": "16 Jan 2021",
        "text": "[WILMINGTON] US President-elect Joe Biden on Friday said he would order increased production of syringes and other supplies to ramp up vaccinations against Covid-19 and improve upon the Trump administration rollout that he called a \"dismal failure\"."
    },
    {
        "title": "Biden's giant aid plan to be opening salvo in legislative battle",
        "date": "16 Jan 2021",
        "text": "PRESIDENT-ELECT Joe Biden's US$1.9 trillion economic relief proposal serves as the opening salvo in a legislative battle that could be prolonged by the go-big price tag and the inclusion of proposals opposed by many Republicans."
    },
    {
        "title": "    US: Big Biden stimulus no balm for US stocks, Dow loses 0.6%",
        "date": "16 Jan 2021",
        "text": "[NEW YORK] President-elect Joe Biden's massive plan to help the US economy didn't shake Wall Street's downbeat sentiment on Friday, with major indices losing ground in the last full trading week of Donald Trump's presidency."
    },
    {
        "title": "Asia: Markets mixed after Biden unveils huge stimulus plan",
        "date": "15 Jan 2021",
        "text": "[HONG KONG] Joe Biden's US$1.9 trillion stimulus proposal was met with a shrug in Asia on Friday as observers said the massive spending spree had been largely factored into valuations, though optimism about the long-term economic outlook continued to provide support."
    },
    {
        "title": "    Biden to unveil US$1.9t economic plan as US recovery buckles",
        "date": "15 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden will unveil a plan on Thursday to inject US$1.9 trillion into the US economy as evidence mounts that the recovery from the sharp downturn caused by Covid-19 is flagging."
    },
    {
        "title": "    US: Stocks dip as market awaits Biden stimulus plan",
        "date": "15 Jan 2021",
        "text": "[NEW YORK] Wall Street stocks finished a choppy session modestly lower Thursday as the market awaited details of President-elect Joe Biden's stimulus package after digesting disappointing labor data."
    },
    {
        "title": "    US: Dow, Nasdaq hit record highs as focus turns to Biden's stimulus plan",
        "date": "15 Jan 2021",
        "text": "[NEW YORK] The Dow and the Nasdaq hit record highs on Thursday in anticipation of President-elect Joe Biden's pandemic aid proposal to jump-start a struggling economy after data highlighted weakening labour market conditions."
    },
    {
        "title": "Asia: Most markets rise with Biden stimulus plan in focus",
        "date": "14 Jan 2021",
        "text": "[HONG KONG] Asian markets mostly enjoyed fresh gains on Thursday as investors await Joe Biden's proposals for a vast new stimulus as well as comments from the head of the Federal Reserve on its policy outlook."
    },
    {
        "title": "    Biden to unveil economic plan as US recovery buckles",
        "date": "14 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden on Thursday will unveil his plan to revive the US economy, as evidence mounts that its recovery from the coronavirus pandemic is flagging despite trillions of dollars in government spending."
    },
    {
        "title": "    Architect of Obama pivot to steer Asia policy for Biden",
        "date": "14 Jan 2021",
        "text": "[WASHINGTON] Kurt Campbell, a key architect of Barack Obama's US \"pivot\" to Asia, will take a top job for President-elect Joe Biden, signaling renewed efforts to rally with allies in the face of a rising China."
    },
    {
        "title": "Biden must adopt multilateral tactics for China policy",
        "date": "14 Jan 2021",
        "text": "AS recently as five years ago, there was a vigorous debate in Washington regarding US policy towards China. Today, that debate is over. The broad consensus - among both Republicans and Democrats - is that the US-China relationship is necessarily one of \"strategic competition\". The United States must lean against China's rise using the broad range of tools at its disposal."
    },
    {
        "title": "    US cancels UN envoy's trip to Taiwan, citing Biden transition",
        "date": "13 Jan 2021",
        "text": "[NEW YORK] The US State Department's cancellation of all travel this week includes a planned visit to Taiwan by US Ambassador to the United Nations Kelly Craft, a State Department spokesperson said on Tuesday."
    },
    {
        "title": "    Walmart, Disney suspend contributions to US lawmakers who opposed Biden certification",
        "date": "13 Jan 2021",
        "text": "[NEW YORK] Walmart, the world's biggest retailer and Walt Disney joined other major companies in indefinitely suspending donations to US lawmakers who voted against President-elect Joe Biden's election certification."
    },
    {
        "title": "    Biden to tap former derivatives regulator to head SEC: reports",
        "date": "13 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden is expected to nominate a former Obama administration derivatives regulator with a reputation for toughness as the country's top stock market watchdog, US media reported on Tuesday."
    },
    {
        "title": "    Biden taps career diplomat William Burns as CIA chief",
        "date": "12 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden on Monday announced William Burns as his pick to lead the Central Intelligence Agency, tapping a retired veteran diplomat who helped lead secret talks with Iran."
    },
    {
        "title": "Asia: Most markets, dollar rise as Biden pledges huge stimulus",
        "date": "11 Jan 2021",
        "text": "[HONG KONG] Asian markets mostly rose with the dollar Monday following another record performance on Wall Street as investors cheered the prospect of a further massive stimulus for the US economy, with President-elect Joe Biden calling for a spending spree in the trillions of dollars."
    },
    {
        "title": "    Marriott, BlueCross suspend donations to US lawmakers who voted against Biden certification",
        "date": "11 Jan 2021",
        "text": "[WASHINGTON] Marriott International Inc, the world's largest hotel company, and the Blue Cross Blue Shield Association (BCBSA) said on Sunday they will suspend donations to US lawmakers who voted against certifying President-elect Joe Biden's victory last week."
    },
    {
        "title": "    Pence will break with Trump and attend Biden-Harris inauguration",
        "date": "10 Jan 2021",
        "text": "[WASHINGTON] Vice-President Mike Pence will attend the inauguration of President-elect Joe Biden and Vice-President-elect Kamala Harris, breaking ranks with President Donald Trump, who said that he wouldn't attend."
    },
    {
        "title": "North Korea's Kim calls US 'our biggest enemy' in challenge to Biden",
        "date": "09 Jan 2021",
        "text": "[SEOUL] North Korean leader Kim Jong Un called for more advanced nuclear weapons and said the US is \"our biggest enemy,\" state media said on Saturday, presenting a stark challenge to President-elect Joe Biden just days before he takes office."
    },
    {
        "title": "Biden to unveil trillions in pandemic economic relief spending next week",
        "date": "09 Jan 2021",
        "text": "[WILMINGTON] US President-elect Joe Biden said Americans need more economic relief from the coronavirus pandemic now and that he will deliver a plan costing \"trillions\" of dollars next week."
    },
    {
        "title": "    US: Stocks end at records again as Biden eyes more stimulus",
        "date": "09 Jan 2021",
        "text": "[NEW YORK] Wall Street stock indices closed at records again Friday as anticipation of a new fiscal relief package offset poor December jobs figures."
    },
    {
        "title": "    Biden names final economic team picks",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden on Thursday unveiled his picks for commerce secretary, labour secretary and small business administrator to fill his incoming economics team."
    },
    {
        "title": "    Trump acknowledges Biden victory a day after Capitol chaos",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump conceded on Thursday that Joe Biden will be the next US president, a day after his supporters stormed the US Capitol as Congress was certifying Mr Biden's victory in a stunning assault on American democracy."
    },
    {
        "title": "Biden calls Capitol protests one of 'darkest days' in US history",
        "date": "08 Jan 2021",
        "text": "[WILMINGTON, United States] US President-elect Joe Biden said on Thursday that Donald Trump had incited one of the \"darkest days\" in US history, a day after pro-Trump rioters smashed their way into the Capitol."
    },
    {
        "title": "Biden confirms Merrick Garland as pick for attorney general",
        "date": "08 Jan 2021",
        "text": "[WILMINGTON, United States] President-elect Joe Biden on Thursday introduced Merrick Garland - a centrist judge who Republicans denied a seat on the Supreme Court five years ago - as his pick for US attorney general."
    },
    {
        "title": "US Congress certifies Biden win hours after Capitol Hill assault",
        "date": "08 Jan 2021",
        "text": "HOURS after hundreds of President Donald Trump's supporters stormed the US Capitol in a harrowing assault on American democracy, a shaken Congress on Thursday formally certified Democrat Joe Biden's election victory."
    },
    {
        "title": "Trump, Republican malcontents will add to obstacles for Biden",
        "date": "08 Jan 2021",
        "text": "THE mob scenes at the US Capitol building in Washington on Wednesday (Thursday morning, Singapore time) could be seen as the opening to the final act of Donald Trump's controversial one-term presidency."
    },
    {
        "title": "    Trump assures orderly transition to a Biden presidency",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump, minutes after Congress certified President-elect Joe Biden's Electoral College Victory and hours after Trump supporters broke into the Capitol, pledged \"an orderly transition.\" \"Even though I totally disagree with the outcome of the election, and the facts bear me out, nevertheless there will be an orderly transition on January 20th,\" Mr Trump said in a statement posted on Twitter by his aide Dan Scavino early Thursday morning."
    },
    {
        "title": "US Congress affirms Biden's victory",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] The US Congress on Thursday certified enough Electoral College votes for Democrat Joe Biden to hand him the victory in the Nov 3 presidential race over Republican President Donald Trump."
    },
    {
        "title": "US Congress rejects first challenge to certifying Biden win",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] The US Senate and House late Wednesday overwhelmingly rejected the objection by some Republican lawmakers to certifying Arizona's electoral vote for Joe Biden, after a riot by Donald Trump supporters forced a delay in the process."
    },
    {
        "title": "Investors reposition for stimulus, spending and tax as they look to Biden",
        "date": "07 Jan 2021",
        "text": "[NEW YORK] Investors are looking ahead to the next US administration after Democrats won control of Congress on Wednesday, a political shift that could strengthen the hand of President-elect Joe Biden in pushing through policies such as more fiscal spending and higher taxes."
    },
    {
        "title": "Pelosi says Biden win certification to resume 'tonight' once Capitol secure",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] House Speaker Nancy Pelosi said lawmakers will resume counting electoral votes on Wednesday once the US Capitol is given an all clear, after the certification process was halted when Donald Trump supporters stormed the building."
    },
    {
        "title": "    Biden brands Capitol violence 'insurrection', demands Trump call off siege",
        "date": "07 Jan 2021",
        "text": "[WILMINGTON] President-elect Joe Biden on Wednesday denounced the storming of the US Capitol as an \"insurrection\" and demanded President Donald Trump go on television to call an end to the violent \"siege.\""
    },
    {
        "title": "What can we expect from Biden on US foreign policy?",
        "date": "07 Jan 2021",
        "text": "AMERICAN foreign policy tends to oscillate between inward and outward orientations. Former president George W Bush was an interventionist; his successor, Barack Obama, less so. And Donald Trump was mostly non-interventionist. What should we expect from Joe Biden?"
    },
    {
        "title": "    Biden's Secretary of State nominee says Hong Kong arrests 'assault on... universal rights'",
        "date": "06 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden's pick for Secretary of State blasted Hong Kong authorities for arresting some 50 opposition figures on Wednesday under a new national security law."
    },
    {
        "title": "Biden promises 'new day', Trump heads to Georgia on eve of pivotal Senate runoffs",
        "date": "05 Jan 2021",
        "text": "[ATLANTA] President-elect Joe Biden urged Georgia voters on Monday to send two Democrats to Washington in Tuesday runoffs that will decide control of the US Senate, while President Donald Trump prepared his own pitch to keep the chamber in Republican hands."
    },
    {
        "title": "    Top US executives demand Congress certify Biden victory",
        "date": "05 Jan 2021",
        "text": "[NEW YORK] An array of prominent US business executives on Monday called for Congress to certify Joe Biden as the new US president, writing in a joint letter that it is time \"to move forward.\""
    },
    {
        "title": "Beijing seeks to wrong-foot Biden with Brussels deal",
        "date": "05 Jan 2021",
        "text": "A COMMON frustration of commuters across the world is lengthy waits only to find that two trains or buses then arrive at once. This is a predicament that the European Union related to in the last week of December, with a brace of key trade and investment deals finally agreed, after years of difficult negotiations."
    },
    {
        "title": "Biden plans minimalist trip from Capitol to White House on inauguration day",
        "date": "05 Jan 2021",
        "text": "US President-elect Joe Biden's inaugural committee has released new details about his trip to the White House after his swearing-in at the US Capitol that further underscore the downsized and largely virtual nature of his Inauguration Day plans."
    },
    {
        "title": "    Trump, Biden to rally in Georgia ahead of high-stakes Senate races",
        "date": "04 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump travels to Georgia on Monday in a bid to keep the US Senate in the hands of his Republican Party, after his efforts to overturn his own defeat in the state have injected new uncertainty into a pair of races that are seen as too close to call."
    },
    {
        "title": "A dozen US senators plan to oppose Biden certification",
        "date": "03 Jan 2021",
        "text": "[WASHINGTON] A group of Republican senators led by veteran lawmaker Ted Cruz said Saturday they will challenge Joe Biden's election win - the latest last-ditch move to support Donald Trump's efforts to undermine the vote."
    },
    {
        "title": "Washington has been lucrative for some on Biden's team",
        "date": "02 Jan 2021",
        "text": "[WASHINGTON] President-elect Joe Biden's choice for Treasury secretary, Janet Yellen, collected more than US$7 million in speaking fees over the past two years from major corporations and Wall Street banks that have a keen interest in the financial policies she will oversee after her expected confirmation to lead the Treasury Department."
    },
    {
        "title": "US detects first case of Covid-19 variant as Biden offers gloomy vaccine outlook",
        "date": "30 Dec 2020",
        "text": "[LOS ANGELES] The first known US case of a highly infectious coronavirus variant was detected in Colorado on Tuesday as President-elect Joe Biden warned it could take years for most Americans to be vaccinated for the virus at current distribution rates."
    },
    {
        "title": "Biden: Trump aides setting 'roadblocks' for his transition team",
        "date": "29 Dec 2020",
        "text": "[WILMINGTON] President-elect Joe Biden said on Monday many of America's security agencies had been \"hollowed out\" under President Donald Trump and the lack of information being provided to his transition team by the outgoing administration was an \"irresponsibility\"."
    },
    {
        "title": "What lifted Trump could sink Biden",
        "date": "29 Dec 2020",
        "text": "VERY few of the people who voted for US President Donald Trump in the 2020 election are plutocrats who benefited from his and congressional Republicans' tax cut, or even wannabe plutocrats who can hope to benefit from it in the future. Some Trump voters doubtless are very focused on the installation of right-wing judges on the federal bench. But many among the 74 million who voted for Mr Trump did so for other reasons."
    },
    {
        "title": "Japan official calls Taiwan 'red line', urges Biden to 'be strong'",
        "date": "26 Dec 2020",
        "text": "[TOKYO] A top Japanese defence official on Friday urged US President-elect Joe Biden to \"be strong\" in supporting Taiwan in the face of an aggressive China, calling the island's safety a \"red line\"."
    },
    {
        "title": "China-EU trade talks hit another snag as Biden camp objects",
        "date": "25 Dec 2020",
        "text": "CHINA and the European Commission appeared close to announcing a landmark agreement this week that would make it easier for their companies to invest in each other's economies. Then it hit another snag: a tweet by a top aide to Joe Biden signalled that the president-elect was not happy about the deal."
    }
]