[
    {
        "title": "Dozens of former Republican officials in talks to form anti-Trump third party",
        "date": "11 Feb 2021",
        "text": "[LOS ANGELES] Dozens of former Republican officials, who view the party as unwilling to stand up to former President Donald Trump and his attempts to undermine US democracy, are in talks to form a centre-right breakaway party, four people involved in the discussions told Reuters."
    },
    {
        "title": "US senators transfixed by riot footage shown at Trump trial",
        "date": "10 Feb 2021",
        "text": "[WASHINGTON] With footage of a pro-Trump mob storming the US Capitol playing out in their chamber, US senators sat transfixed before the shocking images that dominated the start of the former president's impeachment trial."
    },
    {
        "title": "Trump defence urges dismissal of 'absurd' impeachment trial",
        "date": "09 Feb 2021",
        "text": "[WASHINGTON] Donald Trump's legal team argued on Monday on the eve of his impeachment trial that the case is constitutionally flawed and it was \"absurd\" to hold the former president responsible for the US Capitol riot."
    },
    {
        "title": "Trump refuses to testify in 'unconstitutional' impeachment trial",
        "date": "05 Feb 2021",
        "text": "[WASHINGTON] Former president Donald Trump refused on Thursday to testify in his looming impeachment trial after being called by House prosecutors to give evidence, branding the process \"unconstitutional.\""
    },
    {
        "title": "Social media in the post-Trump world",
        "date": "04 Feb 2021",
        "text": "FOLLOWING the deadly siege on the Capitol building in Washington DC on Jan 6, technology giants cracked down on tens of thousands of extremists and conspiracy theorists. The purge's most famous victim was former United States president Donald Trump, who was banned from Twitter, Facebook and Instagram \"due to the risk of further incitement of violence\", as Twitter put it."
    },
    {
        "title": "Biden to streamline US immigration, chip away at Trump legacy",
        "date": "03 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden will sign three more executive orders on immigration on Tuesday as part of a drive to erase the hardline legacy of Donald Trump, including an effort to reunite children separated from their parents at the US border with Mexico."
    },
    {
        "title": "Trump 'singularly responsible' for riot, impeachment trial brief claims",
        "date": "03 Feb 2021",
        "text": "[WASHINGTON] Donald Trump was \"singularly responsible\" for the deadly US Capitol riot last month and acquitting the former president could damage American democracy, lawmakers leading the impeachment case said Tuesday, a week before his Senate trial begins."
    },
    {
        "title": "Trump aid delay snarled US unemployment systems: study",
        "date": "03 Feb 2021",
        "text": "[WASHINGTON] The brief expiration of US pandemic unemployment benefits in December left jobless workers waiting for billions of dollars in aid and states struggling to reactivate the programmes, according to a study released Tuesday."
    },
    {
        "title": "Biden to keep tariffs on aluminum imports from UAE, reversing Trump",
        "date": "02 Feb 2021",
        "text": "[WASHINGTON] US President Joe Biden will maintain a tariff of 10 per cent on aluminum imports from the United Arab Emirates, reversing Donald Trump's move to end the levies on his last day as president, the White House said on Monday."
    },
    {
        "title": "Trump's new impeachment team signals aggressive defence",
        "date": "02 Feb 2021",
        "text": "[WASHINGTON] One declined to prosecute Bill Cosby for rape, trading lawsuits instead with his alleged victim; another considered defending alleged sex trafficker Jeffrey Epstein."
    },
    {
        "title": "Some ex-Bush officials leave Republican Party, citing Trump cult",
        "date": "02 Feb 2021",
        "text": "DOZENS of Republicans in former president George W Bush's administration are leaving the party, dismayed by a failure of many elected Republicans to disown Donald Trump after his false claims of election fraud sparked a deadly storming of the US Capitol last month."
    },
    {
        "title": "Trump says he has hired new impeachment defence lawyers",
        "date": "01 Feb 2021",
        "text": "[WASHINGTON] Former US president Donald Trump announced on Sunday that he had hired two new lawyers to head his defence team for his historic second impeachment trial."
    },
    {
        "title": "US Republican Party's future in balance as Trump trial looms",
        "date": "01 Feb 2021",
        "text": "[WASHINGTON] US Republicans on Sunday braced for a battle over the future of their party after Donald Trump changed lawyers days before his impeachment trial in an apparent sign he is determined to maintain the 2020 election was fraudulent."
    },
    {
        "title": "Trump flexes political muscle, meets top House Republican",
        "date": "29 Jan 2021",
        "text": "[WASHINGTON] Donald Trump met with US House Minority Leader Kevin McCarthy in Florida on Thursday amid a tug of war over the Republican Party's future, with congressional leadership appearing eager to present a united front with the former president."
    },
    {
        "title": "Biden polls higher in first week than Trump at any time",
        "date": "28 Jan 2021",
        "text": "[WASHINGTON] US President Joe Biden has a higher approval rating after one week in office than Donald Trump did in his entire presidency, a new poll found on Wednesday."
    },
    {
        "title": "Biden doesn't believe Trump will be convicted at his impeachment trial: CNN",
        "date": "26 Jan 2021",
        "text": "[WASHINGTON] US President Joe Biden said on Monday he does not believe there will be enough votes to convict former President Donald Trump at his impeachment trial, CNN reported."
    },
    {
        "title": "Trump impeachment heads to US Senate on Monday, triggering trial",
        "date": "23 Jan 2021",
        "text": "[WASHINGTON] Donald Trump will go on trial in the US Senate soon after a fresh impeachment case against the former president is transmitted on Monday by the House of Representatives, top lawmakers announced."
    },
    {
        "title": "Biden inauguration draws bigger television audience than Trump's",
        "date": "22 Jan 2021",
        "text": "[NEW YORK] The TV audience for Joe Biden's inauguration surpassed the number who watched Donald Trump four years ago, a sign that news channels may keep viewers' interest during a new administration."
    },
    {
        "title": "Business makes the case for a post-Trump reset",
        "date": "22 Jan 2021",
        "text": "A PROVOCATIVE memo that was circulated among policymakers on both sides of the aisle and the Biden transition team ahead of his inauguration states: \"Business leaders must realise that they not only have a moral obligation, but also a commercial stake in advocating for a fairer, more equitable system. Unless and until the core problem of inequality is addressed, all other overarching objectives and desires will remain elusive.\" Those sentences are even more notable for who wrote it."
    },
    {
        "title": "Biden to roll back Trump policies, remake US role in climate crisis",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden committed the United States to rejoining the Paris climate accord, blocked an oil pipeline project and froze Arctic drilling in a raft of executive orders signed hours after taking office Wednesday."
    },
    {
        "title": "China sanctions Pompeo, Trump officials for violating 'sovereignty'",
        "date": "21 Jan 2021",
        "text": "[BEIJING] China said Wednesday it was sanctioning more than two dozen members and ex-officials in former president Donald Trump's government, including his secretary of state Mike Pompeo, for violating the country's \"sovereignty\" by making \"crazy\" policy moves."
    },
    {
        "title": "Biden says Trump wrote him 'very generous letter'",
        "date": "21 Jan 2021",
        "text": "[WASHINGTON] President Joe Biden said Wednesday that outgoing president Donald Trump had left him a \"very generous\" letter in the Oval Office, in keeping with tradition."
    },
    {
        "title": "On Day One, Biden moves swiftly to undo Trump's legacy",
        "date": "21 Jan 2021",
        "text": "PRESIDENT-ELECT Joe Biden will unleash a full-scale assault on his predecessor's legacy on Wednesday, acting hours after taking the oath of office to sweep aside President Donald Trump's pandemic response, reverse his environmental agenda, tear down his anti-immigration policies, bolster the sluggish economic recovery and restore federal efforts aimed at promoting diversity."
    },
    {
        "title": "Trump signs order to restrict foreign use of cloud companies",
        "date": "21 Jan 2021",
        "text": "ON his last full day in office, US President Donald Trump signed an executive order the White House said was aimed at preventing foreign malicious cyber actors from using US online infrastructure to carry out their activities."
    },
    {
        "title": "Trump leaves White House, skipping Biden inauguration",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump left the White House for the last time on Wednesday, skipping the inauguration of successor Joe Biden as the 46th US president in an extraordinary break with tradition."
    },
    {
        "title": "In farewell address, Trump wishes luck to next administration without mentioning Biden",
        "date": "20 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump, in a farewell address released on Tuesday, touted his legacy and wished luck to the new administration of President-elect Joe Biden but without acknowledging his successor by name."
    },
    {
        "title": "YouTube bans Trump for another week over inauguration violence concerns",
        "date": "20 Jan 2021",
        "text": "[SAN FRANCISCO] YouTube said on Tuesday it was extending a one-week ban on outgoing US President Donald Trump uploading videos or live-streaming to his channel for at least an additional seven days."
    },
    {
        "title": "America should set sights high for post-Trump reconstruction",
        "date": "20 Jan 2021",
        "text": "THE inauguration of US President-elect Joe Biden on Wednesday will usher in momentous change for the better for the United States. It may also signal a unique opportunity to bolster liberal democracy around the world."
    },
    {
        "title": "In farewell video, Melania Trump says be passionate, but not violent",
        "date": "19 Jan 2021",
        "text": "[WASHINGTON] First Lady Melania Trump released a farewell message Monday as she prepares to leave the White House, saying that \"violence is never the answer\" weeks after the president's supporters stormed the US Capitol."
    },
    {
        "title": "Biden team says US will not lift travel bans, despite Trump statement",
        "date": "19 Jan 2021",
        "text": "[WASHINGTON] US President-elect Joe Biden's spokeswoman quickly dismissed Donald Trump's announcement on Monday that a Covid-19 ban on travelers arriving from much of Europe and Brazil would be lifted, underlining the fractious transition of power."
    },
    {
        "title": "Trump lifting Covid-19 travel restrictions on Europe, UK, Brazil: sources",
        "date": "19 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump will rescind entry bans for most non-US citizens who recently were in Brazil and much of Europe starting on Jan. 26, two officials briefed on the matter told Reuters on Monday."
    },
    {
        "title": "Leaving office, Trump has lowest approval rating of his presidency",
        "date": "19 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump will leave the White House this week with the lowest approval rating of his presidency, with just 34 per cent of Americans supporting the job he has done, a Gallup poll showed on Monday."
    },
    {
        "title": "Trump halts shipments to Huawei from Intel, other suppliers",
        "date": "19 Jan 2021",
        "text": "THE Trump administration notified Huawei suppliers, including chipmaker Intel, that it is revoking certain licences to sell to the Chinese company and intends to reject dozens of other applications to supply the telecommunications firm, people familiar with the matter told Reuters."
    },
    {
        "title": "Trump goes, but global populism may still grow",
        "date": "19 Jan 2021",
        "text": "DONALD Trump's departure from office on Wednesday will be welcomed by many across the world who decry the rise of global populism. Yet Mr Trump is a symptom, not a cause, of populism whose rise may only grow into the 2020s fuelled by the novel coronavirus crisis which has triggered a deeper, broader global recession than even that of the international financial crisis a decade ago."
    },
    {
        "title": "Trump administration slams China's Huawei, halting shipments from Intel, others: sources",
        "date": "18 Jan 2021",
        "text": "[NEW YORK] The Trump administration notified Huawei suppliers, including chipmaker Intel, that it is revoking certain licenses to sell to the Chinese company and intends to reject dozens of other applications to supply the telecommunications firm, people familiar with the matter told Reuters."
    },
    {
        "title": "Trump brand tarnished after bruising presidency and Capitol attack",
        "date": "18 Jan 2021",
        "text": "DONALD Trump shot to prominence with a business empire that bears his name, but after four years of political tumult capped by his supporters' violent attack on the Capitol, the US president's brand stands tarnished, threatening his businesses, experts say."
    },
    {
        "title": "Trump to leave town early Wednesday before Biden inauguration",
        "date": "16 Jan 2021",
        "text": "[WASHINGTON] By the time Joe Biden is sworn in as the 46th US president Wednesday, his scandal-tainted predecessor Donald Trump will already be far away, having helicoptered out of the White House a last time earlier that morning, an official said Friday."
    },
    {
        "title": "US imposes fresh sanctions on Iran in final days of Trump presidency",
        "date": "16 Jan 2021",
        "text": "[WASHINGTON] The United States on Friday imposed sanctions on companies in Iran, China and the United Arab Emirates for doing business with the Islamic Republic of Iran Shipping Lines and on three Iranian entities over conventional arms proliferation."
    },
    {
        "title": "Trump plans to live at Mar-a-Lago, employ some current aides",
        "date": "15 Jan 2021",
        "text": "[WASHINGTON] Donald Trump plans to fly to his Mar-a-Lago resort in Florida the morning of Joe Biden's inauguration, where several current White House staff are expected to work for him or his son-in-law, Jared Kushner, after his presidency, according to people familiar with the matter."
    },
    {
        "title": "Trump administration nudges Fannie Mae, Freddie Mac away from government control",
        "date": "15 Jan 2021",
        "text": "[WASHINGTON] The US Treasury Department said Thursday it was altering its stake in Fannie Mae and Freddie Mac, charting a course for the housing finance giants to move away from government control, while acknowledging numerous issues will have to be solved by President-elect Joe Biden's administration."
    },
    {
        "title": "Trump's Florida club warned over maskless New Year party",
        "date": "15 Jan 2021",
        "text": "[MIAMI] President Donald Trump's Mar-a-Lago club in Florida has received a warning from county authorities, following video of the luxury retreat's New Year's Eve party that showed a crowd of revellers ignoring Covid-19 restrictions."
    },
    {
        "title": "Trump administration takes final swipes at China and its companies",
        "date": "15 Jan 2021",
        "text": "[WASHINGTON] The Trump administration in its waning days took another swipe at China and its biggest firms on Thursday, imposing sanctions on officials and companies for alleged misdeeds in the South China Sea and imposing an investment ban on nine more firms."
    },
    {
        "title": "Once again, Trump's fate in Senate leader McConnell's hands",
        "date": "15 Jan 2021",
        "text": "[WASHINGTON] Mitch McConnell bridled over Donald Trump's crude governing style but found him a valuable White House ally. Now, the powerful US Senate majority leader controls the outgoing president's political future."
    },
    {
        "title": "Trump's impeachment in House could set off bitter Senate fight",
        "date": "15 Jan 2021",
        "text": "THE second impeachment of President Donald Trump by the US House of Representatives, for inciting last week's deadly rampage at the Capitol, could set off a bitter Senate fight that entangles the early days of President-elect Joe Biden's term."
    },
    {
        "title": "Trump finds himself abandoned by the city that made his name",
        "date": "15 Jan 2021",
        "text": "THE backlash against President Donald Trump is cutting into the heart of his brand: New York City real estate and landmarks."
    },
    {
        "title": "Twitter chief backs Trump ban, but says it sets 'dangerous' precedent",
        "date": "15 Jan 2021",
        "text": "TWITTER chief Jack Dorsey on Wednesday backed the social media platform's ban of US President Donald Trump, but said it sets a \"dangerous\" precedent and represents a failure to promote healthy conversation on social networks."
    },
    {
        "title": "Despite Trump's promises, China's trade surplus with US widens to US$317b in 2020",
        "date": "15 Jan 2021",
        "text": "CHINA'S trade surplus with the United States widened last year, underlining the failure of US President Donald Trump to narrow the gap during his tenure, while demand soared for electronics and medical equipment during the coronavirus pandemic."
    },
    {
        "title": "Doctor who declared Trump 'healthiest' president ever dies",
        "date": "15 Jan 2021",
        "text": "[NEW YORK] President Donald Trump's former personal doctor - who claimed Trump had dictated a letter insisting he would be the \"healthiest\" president ever - has died, reports said Thursday."
    },
    {
        "title": "Trump administration shelves planned investment ban on Alibaba, Tencent, Baidu: sources",
        "date": "14 Jan 2021",
        "text": "[WASHINGTON] The Trump administration has scrapped plans to blacklist Chinese tech giants Alibaba, Tencent and Baidu, four people familiar with the matter said, providing a brief reprieve to Beijing's top corporates amid a broader crackdown by Washington."
    },
    {
        "title": "Twitter chief says Trump ban sets 'dangerous' precedent",
        "date": "14 Jan 2021",
        "text": "[SAN FRANCISCO] Twitter chief Jack Dorsey backed the messaging platform's ban of US President Donald Trump, but said Wednesday it sets a \"dangerous\" precedent and represents a failure to promote healthy conversation on the social network."
    },
    {
        "title": "Snap says it is permanently terminating Trump's account",
        "date": "14 Jan 2021",
        "text": "[NEW YORK] Snap Inc is permanently terminating US President Donald Trump's Snapchat account, a company spokeswoman said in a statement on Wednesday."
    },
    {
        "title": "US: Stocks end mostly up as House impeaches Trump again",
        "date": "14 Jan 2021",
        "text": "[NEW YORK] Wall Street stocks finished a choppy session mostly higher as Intel rallied on an executive shakeup while investors monitored a debate on impeaching US President Donald Trump."
    },
    {
        "title": "Trump impeached for unprecedented second time",
        "date": "14 Jan 2021",
        "text": "[WASHINGTON] Donald Trump on Wednesday became the first US president to be impeached for a second time, when a bipartisan majority in the House of Representatives voted to charge him with inciting last week's attack on the US Capitol."
    },
    {
        "title": "No chance of 'fair' trial before Trump leaves office: Senate leader",
        "date": "14 Jan 2021",
        "text": "[WASHINGTON] The US Senate cannot conduct a \"fair or serious\" trial of impeached US President Donald Trump in the short time frame before he leaves office next week, the Senate's Republican leader said Wednesday."
    },
    {
        "title": "YouTube removes Trump content, blocks new uploads for a week",
        "date": "14 Jan 2021",
        "text": "YOUTUBE removed new content from US President Donald Trump's channel, citing concerns about the potential of violence following the riot at the US Capitol last week."
    },
    {
        "title": "US companies are aghast at Trump, but for how long?",
        "date": "14 Jan 2021",
        "text": "IN February 2018, the chief executive of one of America's best known multinationals questioned why so many business people were down on Donald Trump."
    },
    {
        "title": "US: Stocks flat amid Trump impeachment debate",
        "date": "14 Jan 2021",
        "text": "[NEW YORK] Wall Street stocks were flat early Wednesday, with Intel surging on a new CEO appointment as investors monitored a Capitol Hill debate on impeaching US President Donald Trump."
    },
    {
        "title": "Emotions run high as US House begins debate on impeaching Trump",
        "date": "13 Jan 2021",
        "text": "[WASHINGTON] A week after President Donald Trump's supporters stormed the US Capitol, the House of Representatives began debate on Wednesday as lawmakers considered impeaching him for his role in an assault on American democracy that stunned the nation and left five dead."
    },
    {
        "title": "YouTube suspends Trump's channel after violating policy on inciting violence",
        "date": "13 Jan 2021",
        "text": "[BENGALURU] Alphabet’s YouTube said on Tuesday it has suspended Donald Trump’s channel as it violated policies for inciting violence after last week’s assault on the US Capitol by the president’s supporters."
    },
    {
        "title": "Pence rejects invoking 25th Amendment to oust Trump",
        "date": "13 Jan 2021",
        "text": "[WASHINGTON] US Vice-President Mike Pence told House leaders on Tuesday he does not support invoking the 25th Amendment process to remove Donald Trump, all but guaranteeing an impeachment vote against the besieged president."
    },
    {
        "title": "Pompeo cancels last foreign trip amid Trump impeachment moves",
        "date": "13 Jan 2021",
        "text": "[WASHINGTON] US Secretary of State Mike Pompeo on Tuesday canceled his final foreign trip scheduled this week as President Donald Trump faces a second impeachment vote."
    },
    {
        "title": "Trump's long-favoured banks pull back amid riot fallout",
        "date": "13 Jan 2021",
        "text": "TWO of Donald Trump's favoured banks are pulling away from the billionaire president in the wake of last week's deadly riot at the US Capitol."
    },
    {
        "title": "Former Trump property aims to be Palm Beach's most expensive ever",
        "date": "13 Jan 2021",
        "text": "PALM Beach real estate is on a hot streak attributed variously to Covid-19, the state and local tax, and Florida's own zero per cent income tax rate."
    },
    {
        "title": "Trump calls his speech before Congress storming 'totally appropriate'",
        "date": "13 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump denied Tuesday that his speech last week to thousands of supporters, encouraging them to march on Congress, had anything to do with violence that broke out shortly after."
    },
    {
        "title": "Democratic drive to impeach Trump speeds ahead after Capitol siege",
        "date": "12 Jan 2021",
        "text": "[WASHINGTON] Democrats will give President Donald Trump one last chance on Tuesday to leave office days before his term expires or face an unprecedented second impeachment over his supporters' deadly Jan 6 assault on the US Capitol."
    },
    {
        "title": "Twitter suspends 70,000 accounts linked to pro-Trump QAnon conspiracy",
        "date": "12 Jan 2021",
        "text": "[SAN FRANCISCO] Twitter announced on Monday it has suspended \"more than 70,000 accounts\" linked to the QAnon conspiracy theory following the attack on the US Capitol by a mob of President Donald Trump's supporters."
    },
    {
        "title": "Trump, Pence signal common front with Oval Office meeting",
        "date": "12 Jan 2021",
        "text": "[WASHINGTON] Donald Trump and his deputy Mike Pence met on Monday evening in the Oval Office, a senior official said, signaling a common front as Democrats press the vice-president to have the president removed from office as unfit."
    },
    {
        "title": "Trump protest outside Twitter HQ over ban flops",
        "date": "12 Jan 2021",
        "text": "[SAN FRANCISCO] A planned protest outside Twitter's San Francisco headquarters against the social media platform's ban of Donald Trump fizzled out Monday when just a handful of the US president's supporters turned up."
    },
    {
        "title": "Twitter's 'problematic' Trump ban troubles Europe",
        "date": "12 Jan 2021",
        "text": "[PARIS] Twitter's decision to impose a permanent ban on US President Donald Trump's account has sparked some consternation in Europe, with German Chancellor Angela Merkel calling it \"problematic\"."
    },
    {
        "title": "Facebook executive says 'no plans' to end Trump ban",
        "date": "12 Jan 2021",
        "text": "[NEW YORK] Facebook does not intend to lift the suspension on outgoing President Donald Trump, the platform's second in command Sheryl Sandberg said Monday."
    },
    {
        "title": "Black Wednesday at the Capitol: What Trump and Trumpism have wrought",
        "date": "12 Jan 2021",
        "text": "THE events that took place on Jan 6,2021, when a mob, incited by US President Donald Trump, broke into the Capitol Building, smashing windows, breaking doors, destroying furniture, occupying the legislative chambers, forcing a lockdown of the citadel of American democracy and a curfew in Washington, DC, will be recalled as one of the darkest days in American history."
    },
    {
        "title": "House Democrats set in motion bid to remove Trump from office",
        "date": "12 Jan 2021",
        "text": "[WASHINGTON] House Democrats on Monday began an attempt to remove President Donald Trump from office with a demand that Vice President Mike Pence use constitutional authority to declare him unfit, combined with the threat to impeach the president for a second time."
    },
    {
        "title": "Pelosi says ready to start second impeachment of Trump",
        "date": "11 Jan 2021",
        "text": "[WASHINGTON] US House Speaker Nancy Pelosi said on Sunday she would push ahead with efforts to remove President Donald Trump from office during the final days of his administration after his supporters' violent attack on the Capitol."
    },
    {
        "title": "Silence, division between old allies Trump and Pence",
        "date": "11 Jan 2021",
        "text": "[WASHINGTON] Since Vice-President Mike Pence led the Congress session that ceremonially confirmed his boss Donald Trump had lost the November election, relations between the two top Republicans have plummeted to an Arctic chill."
    },
    {
        "title": "US Republican senator says Trump should quit, as momentum for impeachment grows in House",
        "date": "11 Jan 2021",
        "text": "[WASHINGTON] A second Republican US senator called on Sunday for President Donald Trump to resign, saying he could face criminal liability after the deadly storming of the US Capitol by his supporters."
    },
    {
        "title": "Democrats push for second Trump impeachment",
        "date": "11 Jan 2021",
        "text": "DEMOCRATIC-LED efforts to impeach US President Donald Trump for a historic second time gained momentum over the weekend, although it looked far from certain whether enough Republicans would back the move with just days left in his term."
    },
    {
        "title": "Pelosi tells lawmakers to prepare for action next week on Trump",
        "date": "10 Jan 2021",
        "text": "[WASHINGTON] House Speaker Nancy Pelosi told lawmakers to be \"prepared to return to Washington\" next week, suggesting she is considering impeachment or another formal response to President Donald Trump's encouragement of supporters who attacked the Capitol."
    },
    {
        "title": "Pence will break with Trump and attend Biden-Harris inauguration",
        "date": "10 Jan 2021",
        "text": "[WASHINGTON] Vice-President Mike Pence will attend the inauguration of President-elect Joe Biden and Vice-President-elect Kamala Harris, breaking ranks with President Donald Trump, who said that he wouldn't attend."
    },
    {
        "title": "Twitter deletes new Trump tweets on @POTUS, suspends campaign account",
        "date": "09 Jan 2021",
        "text": "[WASHINGTON] Twitter on Friday deleted new tweets posted by US President Donald Trump on official government account @POTUS and suspended the account of his presidential campaign, after booting his personal account off the platform permanently."
    },
    {
        "title": "Twitter permanently suspends Trump's account",
        "date": "09 Jan 2021",
        "text": "[WASHINGTON] Twitter said on Friday that it has permanently suspended US President Donald Trump's account due to the risk of further incitement of violence."
    },
    {
        "title": "Twitter shares down over 2% in after-hours trading after Trump suspension",
        "date": "09 Jan 2021",
        "text": "[NEW YORK] Shares of Twitter were down more than 2 per cent in after-hours trading, moving lower after the company said it was permanently suspending US President Donald Trump's account due to the risk of further incitement of violence."
    },
    {
        "title": "Chinese bargain-hunters pile into stocks blacklisted by Trump",
        "date": "09 Jan 2021",
        "text": "AS United States investors dump shares in Chinese companies blacklisted by outgoing US President Donald Trump, bargain-hunters in China are taking the opposite side of that trade, wagering that a Joe Biden presidency will reverse the investment ban."
    },
    {
        "title": "Democrats inch towards second Trump impeachment after Capitol siege",
        "date": "09 Jan 2021",
        "text": "CONGRESSIONAL Democrats on Friday weighed impeaching US President Donald Trump for a second time, two days after his false claims of election fraud encourage a mob that stormed the US Capitol."
    },
    {
        "title": "Trumpism has lost its legitimacy",
        "date": "09 Jan 2021",
        "text": "JAN 6 of this year will now be an infamous day in American history. Emboldened but delusional supporters of US President Donald Trump intent on halting congressional certification of the presidential election breached the landmark Capitol building in what at best could be described as a riot, and at worst, an insurrection. Breaking through windows and braving tear gas, they were kept at gunpoint from entering the House Chamber where members of the House of Representatives were instructed to take shelter under tables and benches."
    },
    {
        "title": "Democrats inch toward second Trump impeachment after Capitol siege",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] Congressional Democrats on Friday weighed impeaching President Donald Trump for a second time, two days after his false claims of election fraud helped encourage a mob that stormed the US Capitol."
    },
    {
        "title": "Chinese bargain hunters pile into stocks blacklisted by Trump",
        "date": "08 Jan 2021",
        "text": "[SHANGHAI] As US investors dump shares in Chinese companies blacklisted by outgoing President Donald Trump, bargain hunters in China are taking the opposite side of that trade, wagering that a Joe Biden presidency will reverse the investment ban."
    },
    {
        "title": "Surrounded by shrinking circle of aides, a brooding Trump lays into Pence",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump has increasingly isolated himself in the White House, relying on a small group of diehard loyalists and lashing out at those who dare to cross him, including Vice-President Mike Pence, said four sources familiar with the matter."
    },
    {
        "title": "US education secretary quits in second Trump cabinet resignation",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] Education Secretary Betsy DeVos on Thursday became the second member of President Donald Trump's cabinet to quit over a mob attack on the US Capitol, saying he helped incite the violence."
    },
    {
        "title": "Trump acknowledges Biden victory a day after Capitol chaos",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump conceded on Thursday that Joe Biden will be the next US president, a day after his supporters stormed the US Capitol as Congress was certifying Mr Biden's victory in a stunning assault on American democracy."
    },
    {
        "title": "US Vice-President Pence opposes using 25th amendment to remove Trump",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] US Vice-President Mike Pence opposes using the 25th amendment to remove President Donald Trump from power, according to reports from Business Insider and the New York Times."
    },
    {
        "title": "Pelosi says removing Trump 'emergency of highest magnitude'",
        "date": "08 Jan 2021",
        "text": "[WASHINGTON] US House Speaker Nancy Pelosi called on Thursday for President Donald Trump to be urgently removed from power, branding him \"a very dangerous person who should not continue in office.\""
    },
    {
        "title": "Trump insurrection undermines US international interests",
        "date": "08 Jan 2021",
        "text": "SUPPORTERS of US President Donald Trump stormed the US Congress on Wednesday, seeking to overturn November's presidential election result. While the insurrection is - rightly - a cause of grave concern within Washington, the international implications could be profoundly important too for President-elect Joe Biden's foreign agenda."
    },
    {
        "title": "Trump, Republican malcontents will add to obstacles for Biden",
        "date": "08 Jan 2021",
        "text": "THE mob scenes at the US Capitol building in Washington on Wednesday (Thursday morning, Singapore time) could be seen as the opening to the final act of Donald Trump's controversial one-term presidency."
    },
    {
        "title": "Trump's dangerous narcissism may have changed leadership forever",
        "date": "08 Jan 2021",
        "text": "US PRESIDENT Donald Trump and his narcissistic style of leadership will soon vacate the political stage, despite his recent attempt to cajole elected officials into illegally changing the outcome of last November's presidential election and inciting a mob of supporters to storm the US Capitol."
    },
    {
        "title": "Trump assures orderly transition to a Biden presidency",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump, minutes after Congress certified President-elect Joe Biden's Electoral College Victory and hours after Trump supporters broke into the Capitol, pledged \"an orderly transition.\" \"Even though I totally disagree with the outcome of the election, and the facts bear me out, nevertheless there will be an orderly transition on January 20th, \" Mr Trump said in a statement posted on Twitter by his aide Dan Scavino early Thursday morning."
    },
    {
        "title": "Four deaths, 52 arrests made after Trump supporters storm US Capitol",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] Four people died on the US Capitol grounds on Wednesday and 52 people have been arrested, Metropolitan Police Department Chief Robert J. Contee said on Wednesday evening, after supporters of President Donald Trump stormed the Capitol in an unprecedented effort to stop Congress from certifying President-elect Joe Biden's election victory."
    },
    {
        "title": "Woman shot dead in US Capitol was veteran, Trump supporter: reports",
        "date": "07 Jan 2021",
        "text": "[LOS ANGELES] The woman who was fatally shot as Donald Trump's backers stormed the US Capitol on Wednesday was a Ashli Babbitt, a \"strong supporter\" of the president who had served in the United States Air Force, according to press reports."
    },
    {
        "title": "Cabinet members discussing Trump's removal: US media",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] Members of President Donald Trump's cabinet on Wednesday discussed the possibility of removing Mr Trump from office after his supporters stormed the Capitol, three US news channels reported."
    },
    {
        "title": "Twitter suspends Trump from tweeting for 12 hours over violations",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] Twitter said on Wednesday it had temporarily locked the account of US President Donald Trump for 12 hours over \"repeated and severe violations\" of the social media platform's civic integrity rules and threatened permanent suspension."
    },
    {
        "title": "US businesses condemn Capitol 'chaos', blame Trump",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] Major US corporations and businesses groups on Wednesday condemned the occupation of the US Capitol by rioters angry at President Donald Trump's election defeat, with one organisation raising the possibility of the president being removed from office."
    },
    {
        "title": "Police clear US Capitol of Trump supporters, to enforce curfew",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] Police cleared the last of the supporters of President Donald Trump from the US Capitol on Wednesday after they stormed the building and disrupted the certification by Congress of Democrat Joe Biden's election victory."
    },
    {
        "title": "Biden brands Capitol violence 'insurrection', demands Trump call off siege",
        "date": "07 Jan 2021",
        "text": "[WILMINGTON] President-elect Joe Biden on Wednesday denounced the storming of the US Capitol as an \"insurrection\" and demanded President Donald Trump go on television to call an end to the violent \"siege.\""
    },
    {
        "title": "US lawmaker says she is drawing up impeachment papers on Trump after mobs storm Capitol",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] A Democratic congresswoman on Wednesday said she was drawing up articles of impeachment against President Donald Trump after mobs broke into the US Capitol, following Mr Trump's urgings to his supporters to fight to undo his election loss."
    },
    {
        "title": "Trump tells supporters to 'go home' after storming of US Capitol",
        "date": "07 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump told his supporters on Wednesday to \"go home\" after they stormed the US Capitol following a rally during which he repeated his spurious claims of election fraud."
    },
    {
        "title": "Trump bars US transactions with eight Chinese apps",
        "date": "07 Jan 2021",
        "text": "US President Donald Trump on Tuesday signed an executive order banning transactions with eight Chinese software applications, including Ant Group's Alipay mobile payment app, the White House said, escalating tensions with Beijing two weeks before President-elect Joe Biden takes office."
    },
    {
        "title": "Trump signs order banning transactions with eight Chinese apps including Alipay",
        "date": "06 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump on Tuesday signed an executive order banning transactions with eight Chinese software applications, including Ant Group's Alipay, a senior administration official said, escalating tensions with Beijing before President-elect Joe Biden takes office this month."
    },
    {
        "title": "Pence: Man in the middle as Trump seeks unlikely miracle",
        "date": "06 Jan 2021",
        "text": "[WASHINGTON] For three years and 11 months Mike Pence has been Donald Trump's most devoted footsoldier, but in the administration's closing weeks the vice president faces intense pressure from his boss to thwart final certification of the election that they lost."
    },
    {
        "title": "Biden promises 'new day', Trump heads to Georgia on eve of pivotal Senate runoffs",
        "date": "05 Jan 2021",
        "text": "[ATLANTA] President-elect Joe Biden urged Georgia voters on Monday to send two Democrats to Washington in Tuesday runoffs that will decide control of the US Senate, while President Donald Trump prepared his own pitch to keep the chamber in Republican hands."
    },
    {
        "title": "Trump, Biden to rally in Georgia ahead of high-stakes Senate races",
        "date": "04 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump travels to Georgia on Monday in a bid to keep the US Senate in the hands of his Republican Party, after his efforts to overturn his own defeat in the state have injected new uncertainty into a pair of races that are seen as too close to call."
    },
    {
        "title": "Trump heard on tape urging state official to 'find' votes for him",
        "date": "04 Jan 2021",
        "text": "[WASHINGTON] President Donald Trump pressured Georgia's top election official, a fellow Republican, in an extraordinary phone conversation to \"find\" enough votes to overturn Joe Biden's victory in the Southern state, US media reported on Sunday."
    },
    {
        "title": "Trump extends immigration bans despite opposition from US business groups",
        "date": "01 Jan 2021",
        "text": "[WASHINGTON] US President Donald Trump on Thursday extended a pair of immigration bans that block many \"green card\" applicants and temporary foreign workers from entering the country, measures he says are needed to protect US workers amid the pandemic-battered economy."
    },
    {
        "title": "McConnell thwarts Trump bid for US$2,000 virus relief checks",
        "date": "31 Dec 2020",
        "text": "[WASHINGTON] US Senate leader Mitch McConnell dealt a likely death blow on Wednesday to President Donald Trump's bid to boost coronavirus aid to Americans, declining to schedule a swift Senate vote on a bill to raise relief checks to US$2,000 from US$600."
    },
    {
        "title": "US Congress inches closer to Trump veto override as Republican tensions grow",
        "date": "30 Dec 2020",
        "text": "[WASHINGTON] The US Senate was due on Wednesday to hold a procedural vote that could pave the way for Congress to override President Donald Trump's veto of a key defence bill, as tension between the outgoing Republican president and party leaders grows."
    },
    {
        "title": "Senate GOP faces stimulus dilemma as Democrats side with Trump",
        "date": "30 Dec 2020",
        "text": "REPUBLICANS will likely block Democrats' attempts to have the Senate follow the House in boosting stimulus payments for most Americans to US$2,000, even though President Donald Trump backs the bigger cheques."
    },
    {
        "title": "Defying Trump, McConnell delays vote on US$2,000 cheques and opposes defence veto",
        "date": "30 Dec 2020",
        "text": "[WASHINGTON] US Senate majority leader Mitch McConnell on Tuesday put off a vote on President Donald Trump's call to boost Covid-19 relief cheques and urged the Senate to override his veto of a defence Bill, in a rare challenge to his fellow Republican three weeks before the latter vacates the White House."
    },
    {
        "title": "Trump signs pandemic aid and spending bill, averting US government shutdown",
        "date": "29 Dec 2020",
        "text": "US President Donald Trump on Sunday signed into law a US$2.3 trillion pandemic aid and spending package, restoring unemployment benefits to millions of Americans and averting a federal government shutdown in a crisis of his own making."
    },
    {
        "title": "US House approves US$2,000 coronavirus aid checks sought by Trump",
        "date": "29 Dec 2020",
        "text": "[WASHINGTON] The Democratic-led US House of Representatives voted 275-134 to meet President Donald Trump’s demand for US$2,000 Covid-19 relief checks on Monday, sending the measure on to an uncertain future in the Republican-controlled Senate."
    },
    {
        "title": "Biden: Trump aides setting 'roadblocks' for his transition team",
        "date": "29 Dec 2020",
        "text": "[WILMINGTON] President-elect Joe Biden said on Monday many of America's security agencies had been \"hollowed out\" under President Donald Trump and the lack of information being provided to his transition team by the outgoing administration was an \"irresponsibility\"."
    },
    {
        "title": "Trump administration bolsters order barring US investment in Chinese firms",
        "date": "29 Dec 2020",
        "text": "[WASHINGTON] The Trump administration on Monday strengthened an executive order barring US investors from buying securities of alleged Chinese military-controlled companies, following disagreement among US agencies about how tough to make the directive."
    },
    {
        "title": "What lifted Trump could sink Biden",
        "date": "29 Dec 2020",
        "text": "VERY few of the people who voted for US President Donald Trump in the 2020 election are plutocrats who benefited from his and congressional Republicans tax cut, or even wannabe plutocrats who can hope to benefit from it in the future. Some Trump voters doubtless are very focused on the installation of right-wing judges on the federal bench. But many among the 74 million who voted for Mr Trump did so for other reasons."
    },
    {
        "title": "US: Wall Street hits record high after Trump signs fiscal package",
        "date": "28 Dec 2020",
        "text": "[NEW YORK] Wall Street's main indexes hit record highs in early trading on Monday as President Donald Trump's signing of a long-awaited US$2.3 trillion pandemic aid Bill bolstered bets on an economic recovery, helping financial and energy stocks."
    },
    {
        "title": "Trump signs virus relief bill after panning US$600 checks",
        "date": "28 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump signed a bill containing US$900 billion in pandemic relief, backing down from last-minute demands that undercut his own negotiating team, risked a government shutdown and delayed much-needed economic aid as Covid-19 cases continue to rise."
    },
    {
        "title": "Gold gains 1% as Trump signs stimulus bill",
        "date": "28 Dec 2020",
        "text": "[BENGALURU] Gold prices jumped 1 per cent on Monday as the metal's appeal as an inflation hedge was boosted by news that US President Donald Trump had signed a long-awaited coronavirus relief aid bill."
    },
    {
        "title": "Gold set for best close in seven weeks as Trump signs stimulus",
        "date": "28 Dec 2020",
        "text": "GOLD headed for the highest close in seven weeks after President Donald Trump signed a US$900 billion coronavirus stimulus package, pumping more state funds into the world's top economy. Silver surged."
    },
    {
        "title": "Dollar dithers in thin trade as Trump passes pandemic aid package",
        "date": "28 Dec 2020",
        "text": "[TOKYO] The dollar shrugged off news of President Trump relenting on a threat to block a Covid-19 aid bill in thin trading on Monday with many investors on holiday."
    },
    {
        "title": "Trump refuses to budge over aid bill, imperiling jobless benefits for millions",
        "date": "27 Dec 2020",
        "text": "[WASHINGTON] Millions of Americans are about to see their jobless benefits expire on Saturday as President Donald Trump has so far refused to sign into law a US$2.3 trillion pandemic aid and spending package, insisting that it did not do enough to help everyday people."
    },
    {
        "title": "Millions of Americans lose jobless benefits as Trump refuses to sign aid bill",
        "date": "26 Dec 2020",
        "text": "[WASHINGTON] Millions of Americans saw their jobless benefits expire on Saturday after US President Donald Trump refused to sign into law a US$2.3 trillion pandemic aid and spending package, protesting that it did not do enough to help everyday people."
    },
    {
        "title": "Gold steadies as soft US jobs data offsets Trump stimulus threat",
        "date": "24 Dec 2020",
        "text": "[BENGALURU] Gold prices steadied on Thursday as investors balanced elevated US jobless claims that undermined a nascent economic recovery with US President Donald Trump's threat to veto a long-awaited stimulus bill."
    },
    {
        "title": "Trump pardons former campaign chairman Manafort, associate Roger Stone",
        "date": "24 Dec 2020",
        "text": "[PALM BEACH, Florida] US President Donald Trump on Wednesday issued full pardons to his former campaign chairman Paul Manafort, associate Roger Stone, and Charles Kushner, a real estate developer and the father of Mr Trump's son-in-law and adviser Jared Kushner."
    },
    {
        "title": "US: Stocks end mostly up, shrugging off Trump stimulus threat",
        "date": "24 Dec 2020",
        "text": "[NEW YORK] Wall Street stocks finished mostly higher on Wednesday, shrugging off a batch of mostly weak economic data and comments from President Donald Trump that risked derailing a giant economic relief package."
    },
    {
        "title": "Trump pardons spark outrage",
        "date": "24 Dec 2020",
        "text": "[WASHINGTON] An angry backlash on Wednesday met US President Donald Trump's pardons of corrupt Republican congressmen and security guards convicted of killing 14 civilians in a 2007 Baghdad massacre."
    },
    {
        "title": "Trump threatens to not sign US$892b Covid-19 relief bill",
        "date": "24 Dec 2020",
        "text": "US PRESIDENT Donald Trump threatened on Tuesday to not sign an US$892 billion coronavirus relief bill that includes desperately needed money for individual Americans, saying it should be amended to increase the amount in the stimulus cheques."
    },
    {
        "title": "Euro, Aussie gain, ignoring Trump's threat to block stimulus",
        "date": "24 Dec 2020",
        "text": "THE euro rose to US$1.22 and the dollar fell on Wednesday as foreign exchange traders looked beyond US President Donald Trump's threat to block a US$892 billion Covid-19 aid package."
    },
    {
        "title": "Trump's longtime banker at Deutsche Bank resigns",
        "date": "23 Dec 2020",
        "text": "[BENGALURU] Donald Trump's longtime banker at Deutsche Bank will be stepping down from the German lender, with the move coming as the bank looks for ways to cut its relations with the US president."
    },
    {
        "title": "Trump threatens to not sign Covid-19 bill, want bigger stimulus checks",
        "date": "23 Dec 2020",
        "text": "[WASHINGTON] US President Donald Trump threatened on Tuesday not to sign a US$892-billion coronavirus relief bill that includes desperately needed money for individual Americans, saying it should be amended to increase the amount in the stimulus checks."
    },
    {
        "title": "Trump grants full pardon to Russia probe figure George Papadopoulos",
        "date": "23 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump granted a full pardon on Tuesday to George Papadopoulos, a former campaign aide who pleaded guilty as part of the investigation into Russian meddling in the 2016 presidential election."
    },
    {
        "title": "Trump makes classical style the default for federal buildings",
        "date": "23 Dec 2020",
        "text": "PRESIDENT Donald Trump signed an executive order on Monday that establishes classical architecture as the preferred style for new federal buildings but stops short of banning newer designs from consideration."
    },
    {
        "title": "America isn't finished paying for Trump's incompetence",
        "date": "22 Dec 2020",
        "text": "IN 2016, a few months before Donald Trump was elected president, I wrote a column about his long history as a mismanager that cited this chestnut from his book Crippled America:"
    },
    {
        "title": "Can the GOP get out of the bubble, post-Trump?",
        "date": "22 Dec 2020",
        "text": "THAT it took Republican Senate Majority Leader Mitch McConnell six weeks to admit that the Democratic presidential candidate Joe Biden has won this year's race to the White House says a lot about the current condition of the Grand Old Party (GOP)."
    },
    {
        "title": "Trump signs temporary spending bill into law to avoid US government shutdown",
        "date": "21 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump signed a temporary spending bill into law on Sunday night to avoid a government shutdown, the White House said in a statement."
    },
    {
        "title": "Reports of martial-law talk in Trump meeting draw outrage",
        "date": "21 Dec 2020",
        "text": "[WASHINGTON] With one month to go until Joe Biden takes office, Donald Trump remains fixated on his failed bid to overturn the 2020 election - with his advisors reportedly floating the idea of invoking martial law, triggering outrage and disbelief in Washington."
    },
    {
        "title": "Index providers react to Trump executive order, drop companies with links to China's military",
        "date": "21 Dec 2020",
        "text": "THIS week, S&P Dow Jones Indices and FTSE Russell will begin excluding from their index products a slew of Chinese companies that outgoing US President Donald Trump has accused of having ties to China's military."
    },
    {
        "title": "In last rush, Trump grants mining and energy firms access to public lands",
        "date": "20 Dec 2020",
        "text": "[WASHINGTON] The Trump administration is rushing to approve a final wave of large-scale mining and energy projects on federal lands, encouraged by investors who want to try to ensure the projects move ahead even after President-elect Joe Biden takes office."
    },
    {
        "title": "Trump signs bill that could kick Chinese firms off US stock exchanges",
        "date": "19 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump on Friday signed legislation that would kick Chinese companies off US stock exchanges unless they adhere to American auditing standards, the White House said, giving the Republican one more tool to threaten Beijing with before leaving office next month."
    },
    {
        "title": "Trump, ahead of FDA, says Moderna's Covid-19 vaccine has been approved",
        "date": "18 Dec 2020",
        "text": "[WASHINGTON] US President Donald Trump in a tweet on Friday said Moderna's vaccine had been approved and would ship immediately, although the US Food and Drug Administration has made no public announcement yet regarding its decision."
    },
    {
        "title": "US response to Putin may close door to more arms control talks under Trump",
        "date": "18 Dec 2020",
        "text": "[WASHINGTON] The United States, responding to Russia blaming Washington for starting a new arms race, on Thursday reiterated a proposal already rejected by Moscow for extending their last strategic arms limitation treaty, appearing to close the door to talks in the final weeks of the Trump administration."
    },
    {
        "title": "More in GOP concede Biden win as some stand by Trump's defiance",
        "date": "16 Dec 2020",
        "text": "SENIOR Republicans are signalling to President Donald Trump that it is time to abandon his challenges to the election, but his campaign to dispute the results threatens to keep roiling the party for weeks to come."
    },
    {
        "title": "Biden says Trump 'refused to respect the will of the people'",
        "date": "15 Dec 2020",
        "text": "[WILMINGTON, United States] President-elect Joe Biden tore into Donald Trump on Monday with his strongest criticism since the election, saying the Republican and his allies defied the constitution and the \"will of the people\" in not accepting the results."
    },
    {
        "title": "Trump says Attorney General Barr resigns",
        "date": "15 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump said on Monday that Attorney General William Barr will be leaving his job just before Christmas and Deputy Attorney General Jeff Rosen will become acting attorney general."
    },
    {
        "title": "Trump, Pence, other top officials to be offered Covid-19 vaccine: source",
        "date": "14 Dec 2020",
        "text": "[WASHINGTON] President Donald Trump, Vice-President Mike Pence and other top US officials will be offered the newly approved Covid-19 vaccine beginning on Monday as part of a plan aimed at ensuring the continuity of government, a source familiar with the plans said."
    }
]